In [1]:
import numpy as np
import pandas as pd
from sklearn import linear_model

In [3]:
# Veri seti yüklenir.
data = pd.read_csv('homeprices.csv')
# Veriye göz atılır.
data.head()

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       NaN   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000

In [5]:
# Sütun adları Türkçeye çevrilmiştir.
data.rename(columns = {'area':'alan', 'bedrooms':'oda_sayisi',
'age':'yasi', 'price':'fiyati'}, inplace = True)
# Veri setine göz atılır.
data.head()

   alan  oda_sayisi  yasi  fiyati
0  2600         3.0    20  550000
1  3000         4.0    15  565000
2  3200         NaN    18  610000
3  3600         3.0    30  595000
4  4000         5.0     8  760000